Tekla Open API Reference for Tekla Structures 2025
AnalysisResult.LoadCaseTypeEnum Enumeration
 The load case type.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum LoadCaseTypeEnum
Public Enumeration LoadCaseTypeEnum
Members
Member name | Value | Description
CASE | 1 |  Load case (not a combination to be considered in design).
COMBINATION_ULS | 2 |  Ultimate limit state combination.
COMBINATION_SLS | 3 |  Service limit state combination.
COMBINATION | 4 |  Combination (not limit state).
ENVELOPE | 5 |  Envelope (from group of combinations).
See Also
Reference
Tekla.Structures.Analysis Namespace